clear;clc;
load_plugin("spline");

% 本脚本用于测试 spapi 函数。
% 根据给定的 B 样条节点或样条曲线阶数以及插值条件创建一个 B 格式的样条曲线。

% 测试 s = spapi(knots,x,y)
% knots 为 B 样条的节点。
%  x 为插值条件节点,服从单增序列要求,可以重复。
% y 为上述插值条件节点上的值,如有重复,重复的值被分别视为在该点处的 1, 2, · · · 阶导数值。
% 返回的 s 的阶数 k 满足 k = length(knots) - length(x)。

% Test 1.1-1.7 对 s = spapi(knots,x,y) 进行测试

% Test 1.1 正确输入
%在 B 样条节点 0, 0, 0, 0, 1, 2, 2, 2, 2 上进行 B 样条插值
%插值条件为 s(0) = 2, s(1) = 0, s′ (1) = 1, s′′ (1) =2, s(2) = −1.
% 理论结果:
%       form: 'B-'
%     knots: [0 0 0 0 1 2 2 2 2]
%      coefs: [2 -0.3333 -0.3333 1.0000 -1]
%     number: 5
%      order: 4
%        dim: 1
% 实际结果:
knots1 = [0, 0, 0, 0, 1, 2, 2, 2, 2];
x1 = [0, 1, 1, 1, 2];
y1 = [2, 0, 1, 2, -1];
s1= spapi(knots1, x1, y1)

% Test 1.2 插值条件不相容
% 理论结果: 报错
% 实际结果:
%knots2 = [-3, -1, -0.5, 0.2, 0.4, 0.5, 2 ,3, 4];
%x2 = [0, 1, 1, 1, 2];
%y2 = [2, 0, 1, 2, -1];
%s2= spapi(knots2, x2, y2);

% Test 1.3 输入参数过多
% 理论结果: 报错
% 实际结果:
% s3 = spapi([0, 0, 0, 0, 1, 2, 2, 2, 2],[0, 1, 1, 1, 2],[2, 0, 1, 2, -1],[2 3 4]);

% Test 1.4 x 与 y 的长度不匹配
% 理论结果: 报错
% 实际结果:
%knots4 = [0, 0, 0, 0, 1, 2, 2, 2, 2];
%x4 = [0, 1, 1, 1, 2];
%y4 = [2, 0, 1, 2, -1,2];
%s4= spapi(knots4, x4, y4);

% Test 1.5 输入参数不为向量,而为矩阵
% 理论结果: 报错
% 实际结果:
%knots5 = [0, 0, 0, 0, 1, 2, 2, 2, 2];
%x5 = [0, 1, 1, 1, 2; 0,1,1,1,2];
%y5 = [2, 0, 1, 2, -1];
%s5= spapi(knots5, x5, y5);

% Test 1.6 knots 或 x 不为单增非降排列
% 理论结果: 报错
% 实际结果:
%knots6 = [0, 0, 0, 0, 1, 2, 2, 2, 2];
%x6 = [0, 1, 1, 3, 2];
%y6 = [2, 0, 1, 2, -1];
%s6= spapi(knots6, x6, y6);

% Test 1.7 错误的参数输入，字符串
% 理论结果: 报错
% 实际结果:
%knots7 = [0, 0, 0, 0, 1, 2, 2, 2, 2];
%x7 = "abcde";
%y7 = [2, 0, 1, 2, -1];
%s7= spapi(knots7, x7, y7);


% 测试 s = spapi(k,x,y)
% x,y 为插值条件,要求与 s = spapi(knots,x,y) 相同。
%  返回的 s 是满足插值条件与指定 B 样条节点或指定阶数的样条曲线,为 B 格式。

% Test 1.8-1.14 对 s = spapi(k,x,y) 进行测试

% Test 1.8 正确输入
%在 [0, 4] 上对函数 f (x) = sin(x) 进行 5 次 B 样条拟合
%采样点为区间上均匀分布的 41 个点 0, 0.1, 0.2, ···,3.9, 4。
% 理论结果:
%       form: 'B-'
%     knots: [1×47 double]
%      coefs: [1×41 doule]
%     number: 41
%      order: 6
%        dim: 1
% 实际结果:
x8 = 0:0.1:4;
s8 = spapi(6, x8, sin(x8))


% Test 1.9 B样条的阶数不为整数
% 理论结果: 报错
% 实际结果:
%x9 = 0:0.1:4;
%s9 = spapi(6.5, x9, sin(x9));

% Test 1.10 B样条的阶数过低
% 理论结果: 报错
% 实际结果:
%x10 = 0:0.1:4;
%s10 = spapi(1, x10, sin(x10));

% Test 1.11 输入参数为矩阵
% 理论结果: 报错
% 实际结果:
%x11 = 0:0.1:4;
%s11 = spapi(6, [x11;x11], sin(x11));

% Test 1.12 x 和 y 的长度不匹配
% 理论结果: 报错
% 实际结果:
%x12 = 0:0.1:4;
%s12 = spapi(6, [x12,4.1], sin(x12));

% Test 1.13  x 不为单增非降排列
% 理论结果: 报错
% 实际结果:
%x13 = 0:0.1:4;
%x13 = [x13, 2];
%s13 = spapi(6, x13, sin(x13));

% Test 1.14 x 中的点重复次数过多
% 理论结果: 报错
% 实际结果:
%x14 = 0:0.1:4;
%x14 = [x14,4.1,4.1,4.1,4.1,4.1,4.1];
%s14 = spapi(6, x14, sin(x14));